In [1]:
%matplotlib inline
import pandas as pd

In [2]:
from IPython.core.display import HTML
css = open('style-table.css').read() + open('style-notebook.css').read()
HTML('<style>{}</style>'.format(css))

In [3]:
titles = pd.DataFrame.from_csv('data/titles.csv', index_col=None)
titles.head()

C:\Users\Ben\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: from_csv is deprecated. Please use read_csv(...) instead. Note that some of the default arguments are different, so please refer to the documentation for from_csv when changing your function calls
  """Entry point for launching an IPython kernel.

             title  year
0   Orlando Vargas  2005
1         Niu-Peng  1989
2    Anandabhadram  2005
3   Mahendra Varma  1993
4  Beomdiga shidae  1970

In [4]:
cast = pd.DataFrame.from_csv('data/cast.csv', index_col=None)
cast.head()

C:\Users\Ben\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: from_csv is deprecated. Please use read_csv(...) instead. Note that some of the default arguments are different, so please refer to the documentation for from_csv when changing your function calls
  """Entry point for launching an IPython kernel.

                               title  year       name   type character     n
0                    Suuri illusioni  1985     Homo $  actor    Guests  22.0
1     Gangsta Rap: The Glockumentary  2007  Too $hort  actor   Himself   NaN
2                  Menace II Society  1993  Too $hort  actor   Lew-Loc  27.0
3  Porndogs: The Adventures of Sadie  2009  Too $hort  actor     Bosco   3.0
4                 Stop Pepper Palmer  2014  Too $hort  actor   Himself   NaN

### How many movies are listed in the titles dataframe?

In [5]:
ans1 = len(titles)

In [6]:
print("there are {} titles listed in the dataframe".format(ans1))

there are 214591 titles listed in the dataframe

### What are the earliest two films listed in the titles dataframe?

In [7]:
ans2 = titles.sort_values('year').head(2)
ans2

                                                   title  year
90767                                         Miss Jerry  1894
10994  Reproduction of the Corbett and Fitzsimmons Fight  1897

In [8]:
print("The earliest two films are '{}' and '{}'".format(ans2.iloc[0]['title'],ans2.iloc[1]['title']))

The earliest two films are 'Miss Jerry' and 'Reproduction of the Corbett and Fitzsimmons Fight'

### How many movies have the title "Hamlet"?

In [9]:
t = titles
t[t.title == "Hamlet"]

         title  year
2249    Hamlet  2015
39041   Hamlet  1973
39461   Hamlet  2000
41940   Hamlet  1996
52546   Hamlet  1987
54748   Hamlet  2009
56646   Hamlet  2011
69544   Hamlet  1964
84570   Hamlet  2016
85485   Hamlet  1913
95505   Hamlet  2014
95605   Hamlet  1969
100923  Hamlet  1910
139892  Hamlet  1921
148866  Hamlet  1954
156599  Hamlet  1948
179411  Hamlet  1911
185183  Hamlet  1976
185646  Hamlet  1990

In [10]:
ans3 = len(t[t.title == "Hamlet"])
print("There are {0} movies with the name 'Hamlet'".format(ans3))

There are 19 movies with the name 'Hamlet'

### How many movies are titled "North by Northwest"?

In [11]:
ans4 = len(t[t.title == "North by Northwest"])
print("There are {0} movies with the name 'North by Northwest'".format(ans4))

There are 1 movies with the name 'North by Northwest'

In [12]:
t[t.title == "North by Northwest"]

                     title  year
100262  North by Northwest  1959

### When was the first movie titled "Hamlet" made?

In [13]:
ans5 = t[t.title == 'Hamlet'].sort_values('year')
ans5

         title  year
100923  Hamlet  1910
179411  Hamlet  1911
85485   Hamlet  1913
139892  Hamlet  1921
156599  Hamlet  1948
148866  Hamlet  1954
69544   Hamlet  1964
95605   Hamlet  1969
39041   Hamlet  1973
185183  Hamlet  1976
52546   Hamlet  1987
185646  Hamlet  1990
41940   Hamlet  1996
39461   Hamlet  2000
54748   Hamlet  2009
56646   Hamlet  2011
95505   Hamlet  2014
2249    Hamlet  2015
84570   Hamlet  2016

In [14]:
ans5 = ans5.iloc[0]['year']
print("The first movie titled 'Hamlet' was made in {}".format(ans5))

The first movie titled 'Hamlet' was made in 1910

### List all of the "Treasure Island" movies from earliest to most recent.

In [15]:
print("Here is a list of sorted movies of Treasure Island")
t[t.title == "Treasure Island"].sort_values(by='year')

Here is a list of sorted movies of Treasure Island

                  title  year
48904   Treasure Island  1918
108475  Treasure Island  1920
89471   Treasure Island  1934
52435   Treasure Island  1950
118309  Treasure Island  1972
144139  Treasure Island  1973
191845  Treasure Island  1985
50325   Treasure Island  1999

### How many movies were made in the year 1950?

In [16]:
t[t.year == 1950].sort_values(by='title')

                                                    title  year
111090                                 0 Uhr 15, Zimmer 9  1950
27819                                             48 oras  1950
26374                                     711 Ocean Drive  1950
18750                                  A La Habana me voy  1950
149799                            A Lady Without Passport  1950
32524                                   A Life of Her Own  1950
105715                                  A Modern Marriage  1950
86377   A Ray of Sunshine: An Irresponsible Medley of ...  1950
210914                                A Serra da Aventura  1950
17876                                   A Sombra da Outra  1950
39640                                A Ticket to Tomahawk  1950
117491                             A Woman of Distinction  1950
95566                                          Aadhi Raat  1950
4902                                              Aankhen  1950
27893           Abbott and Costello in the Foreign Legion  1950
1765                                   Absender unbekannt  1950
76126                                  Abuso de confianza  1950
212027                                Across the Badlands  1950
116169                                              Afsar  1950
69569                                   Again... Pioneers  1950
180534                                  Akatsuki no dasso  1950
78775                                Akatsuki no tsuiseki  1950
134747                                    Akbal el bakari  1950
115088                                 Akdeniz korsanlari  1950
141828                                        Akher kedba  1950
98407                                    Al son del mambo  1950
149522                                     Alakh Niranjan  1950
128359                             Alameda da Saudade 113  1950
172728                                           Alhambra  1950
191637                                              Alina  1950
...                                                   ...   ...
75474                                    Wo zhe yi bei zi  1950
17967                                     Woman in Hiding  1950
149867                                   Woman on the Run  1950
85695                             Women from Headquarters  1950
186600                                       Wu Xun zhuan  1950
93066                                   Wu long jiang jun  1950
154324                                       Wyoming Mail  1950
166018                                        Xi lu xiang  1950
35673                                      Xiadao Qinghua  1950
153348                               Xiang dao mei ren yu  1950
113796                                     Xin cha hua nu  1950
54113                                              Yasmin  1950
47378                                       Yi dai yao ji  1950
142673                               Yo quiero ser hombre  1950
200709                                 Yo quiero ser mala  1950
63294                                 Yo quiero ser tonta  1950
52686                                  Young Daniel Boone  1950
55322                               Young Man with a Horn  1950
137172                                       Your Witness  1950
132660                                     Yu hai yi heng  1950
188464                                     Yuki fujin ezu  1950
3422                                Zagovor obrechyonnykh  1950
77158                                    Zalamuni el nass  1950
28876                                              Zeinab  1950
55996                                        Zhujiang lei  1950
99285                                           Zhukovsky  1950
17942                                               Zonk!  1950
145282                            Zui e suo lian shang ji  1950
184099                              Zui e suo lian xia ji  1950
194095                                Zwei in einem Anzug  1950

[1036 rows x 2 columns]

In [17]:
ans7 = len(t[t.year == 1950].sort_values(by='title'))
print("There were {} movies made in 1950".format(ans7))

There were 1036 movies made in 1950

### How many movies were made in the year 1960?

In [18]:
ans8 = len(t[t.year == 1960])

In [19]:
print("there were {} movies made in 1960".format(ans8))

there were 1461 movies made in 1960

### How many movies were made from 1950 through 1959?

In [20]:
ans9 = len(t[(t.year > 1950) & (t.year <1959)])

In [21]:
print("there were {} movies made between 1950 and 1959".format(ans9))

there were 9689 movies made between 1950 and 1959

### In what years has a movie titled "Batman" been released?

In [22]:
ans10 = t[t.title == "Batman"].sort_values(by='year')
ans10

        title  year
56309  Batman  1943
16656  Batman  1989

In [23]:
print("A movie titled 'Batman' has been released in {} and {}".format(ans10.iloc[0]['year'], ans10.iloc[1]['year']))

A movie titled 'Batman' has been released in 1943 and 1989

### How many roles were there in the movie "Inception"?

In [24]:
c = cast
c.head()

                               title  year       name   type character     n
0                    Suuri illusioni  1985     Homo $  actor    Guests  22.0
1     Gangsta Rap: The Glockumentary  2007  Too $hort  actor   Himself   NaN
2                  Menace II Society  1993  Too $hort  actor   Lew-Loc  27.0
3  Porndogs: The Adventures of Sadie  2009  Too $hort  actor     Bosco   3.0
4                 Stop Pepper Palmer  2014  Too $hort  actor   Himself   NaN

In [25]:
ans11 = len(c[c.title == "Inception"])
print("there were {} roles in the movie 'Inception'".format(ans11))

there were 72 roles in the movie 'Inception'

### How many roles in the movie "Inception" are NOT ranked by an "n" value?

In [26]:
c[c.title == "Inception"].head(2)

,title,year,name,type,character,n
85565,Inception,2010,Michael (III) August,actor,LAX Passenger,NaN
130207,Inception,2010,Peter Basham,actor,Fischer's Jet Captain,44.0

In [27]:
ans12 = len(c[(c.title == "Inception") & (c.n.notnull())])
c[(c.title == "Inception") & (c.n.notnull())].head(2)

            title  year          name   type              character     n
130207  Inception  2010  Peter Basham  actor  Fischer's Jet Captain  44.0
161273  Inception  2010  Tom Berenger  actor               Browning   8.0

In [28]:
print("There are {} roles that meet this criteria".format(ans12))

There are 51 roles that meet this criteria

### But how many roles in the movie "Inception" did receive an "n" value?

In [29]:
ans13 = len(c[(c.title == "Inception") & (c.n.isnull())])

In [30]:
print("There are {} roles that meet this criteria".format(ans13))

There are 21 roles that meet this criteria

### Display the cast of "North by Northwest" in their correct "n"-value order, ignoring roles that did not earn a numeric "n" value.

In [31]:
c[(c.title == "North by Northwest") & (c.n.notnull())].sort_values(by='n').head(5)

,title,year,name,type,character,n
773496,North by Northwest,1959,Cary Grant,actor,Roger O. Thornhill,1.0
3084579,North by Northwest,1959,Eva Marie Saint,actress,Eve Kendall,2.0
1292652,North by Northwest,1959,James Mason,actor,Phillip Vandamm,3.0
2776446,North by Northwest,1959,Jessie Royce Landis,actress,Clara Thornhill,4.0
315343,North by Northwest,1959,Leo G. Carroll,actor,The Professor,5.0

In [32]:
print("see sorted values above")

see sorted values above

### Display the entire cast, in "n"-order, of the 1972 film "Sleuth".

In [33]:
c[(c.title == "Sleuth") & (c.year == 1972)].sort_values(by='n')

,title,year,name,type,character,n
1513570,Sleuth,1972,Laurence Olivier,actor,Andrew Wyke,1.0
288502,Sleuth,1972,Michael Caine,actor,Milo Tindle,2.0
330750,Sleuth,1972,Alec Cawthorne,actor,Inspector Doppler,3.0
1299944,Sleuth,1972,John (II) Matthews,actor,Detective Sergeant Tarrant,4.0
2406762,Sleuth,1972,Eve (III) Channing,actress,Marguerite Wyke,5.0
1285278,Sleuth,1972,Teddy Martin,actor,Police Constable Higgs,6.0

### Now display the entire cast, in "n"-order, of the 2007 version of "Sleuth".

In [34]:
c[(c.title == "Sleuth") & (c.year == 2007)].sort_values(by='n')

          title  year                 name     type          character    n
288503   Sleuth  2007        Michael Caine    actor             Andrew  1.0
1147041  Sleuth  2007             Jude Law    actor               Milo  2.0
1602268  Sleuth  2007        Harold Pinter    actor        Man on T.V.  3.0
228757   Sleuth  2007      Kenneth Branagh    actor  Other Man on T.V.  NaN
330751   Sleuth  2007  Alec (II) Cawthorne    actor  Inspector Doppler  NaN
2406761  Sleuth  2007    Eve (II) Channing  actress    Marguerite Wyke  NaN
2958823  Sleuth  2007    Carmel O'Sullivan  actress             Maggie  NaN

### How many roles were credited in the silent 1921 version of Hamlet?

In [35]:
ans17 = len(c[(c.title == "Hamlet") & (c.year == 1921)])

In [36]:
print("{} roles".format(ans17))

9 roles

### How many roles were credited in Branagh’s 1996 Hamlet?

In [37]:
ans18 = len(c[(c.title == "Hamlet") & (c.year == 1996)])

In [38]:
print("{} roles".format(ans18))

55 roles

### How many "Hamlet" roles have been listed in all film credits through history?

In [39]:
len(c[(c.title == "Hamlet")])

299

### How many people have played an "Ophelia"?

In [40]:
c.head(2)

                            title  year       name   type character     n
0                 Suuri illusioni  1985     Homo $  actor    Guests  22.0
1  Gangsta Rap: The Glockumentary  2007  Too $hort  actor   Himself   NaN

In [41]:
len(c[(c.character == "Ophelia")])

96

### How many people have played a role called "The Dude"?

In [42]:
len(c[(c.character == "The Dude")])

16

### How many people have played a role called "The Stranger"?

In [43]:
len(c[(c.character == "The Stranger")])

192

### How many roles has Sidney Poitier played throughout his career?

In [44]:
c.head(2)

                            title  year       name   type character     n
0                 Suuri illusioni  1985     Homo $  actor    Guests  22.0
1  Gangsta Rap: The Glockumentary  2007  Too $hort  actor   Himself   NaN

In [45]:
len(c[(c.name == "Sidney Poitier")])

43

### How many roles has Judi Dench played?

In [46]:
len(c[(c.name == "Judi Dench")])

51

### List the supporting roles (having n=2) played by Cary Grant in the 1940s, in order by year.

### List the leading roles that Cary Grant played in the 1940s in order by year.

### How many roles were available for actors in the 1950s?

### How many roles were avilable for actresses in the 1950s?

### How many leading roles (n=1) were available from the beginning of film history through 1980?

### How many non-leading roles were available through from the beginning of film history through 1980?

### How many roles through 1980 were minor enough that they did not warrant a numeric "n" rank?